НВ_Доработки/InformationRegisters/СБП_QRКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СБП_QRКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>status</Name>
					<Comment>CREATED, BLOCKED, NOT_STARTED, ACCEPTED, REJECTED, RECEIVED</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаГенерации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_mediaType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_content</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>amount</Name>
					<Comment>Сумма операции в копейках</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>payload</Name>
					<Comment>Payload зарегистрированного QR кода в СБП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>qrcType</Name>
					<Comment>Тип QR кода: 01 - Статический QR-код, 02 - Динамический QR-код (QR на кассе), 03 - QR-код для привязки счета Плательщика (подписки)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступлениеНаРС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_height</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_width</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>qrcId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

НВ_Доработки/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дополнительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НВД_qrcld</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НВД_СтрокаQRМетки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НВД_imageParams_content</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НВД_ОрганизацияСБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НВД_СчетСБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_Опт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПотолкиОнлайн_Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправлятьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_Розница</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаККонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификационныйНомерПлательщикаЕвропейскогоНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_ОсновнойEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_ОсновнойТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоказыватьДопИнформацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантОтправкиЭлектронногоЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтактноеЛицоПодписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторБ24</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПотолкиОнлайн_Актуализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеОтправлятьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НВД_ИспользоватьСБП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МеткиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КредитныйЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособДоставкиТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_АдресаДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

НВ_Доработки/HTTPServices/НВД_MerchantNotificationsGPB/Ext/Module.bsl
Функция ПолучитьКонтрагентаПоQRCID(qrcId);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.НВД_qrcld = &qrcId";
	
	Запрос.УстановитьПараметр("qrcId", qrcId);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
	Иначе
		Контрагент = Неопределено;
	КонецЕсли;
    Возврат Контрагент;
КонецФункции

Функция ПолучитьЗаказПоQRCID(qrcId);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СБП_QRКоды.qrcId КАК qrcId,
		|	СБП_QRКоды.status КАК status,
		|	СБП_QRКоды.ДатаГенерации КАК ДатаГенерации,
		|	СБП_QRКоды.imageParams_mediaType КАК imageParams_mediaType,
		|	СБП_QRКоды.imageParams_content КАК imageParams_content,
		|	СБП_QRКоды.amount КАК amount,
		|	СБП_QRКоды.payload КАК payload,
		|	СБП_QRКоды.qrcType КАК qrcType,
		|	СБП_QRКоды.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды
		|ГДЕ
		|	СБП_QRКоды.qrcId = &qrcId";
	
	Запрос.УстановитьПараметр("qrcId", qrcId);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Заказ = ВыборкаДетальныеЗаписи.Заказ;
	Иначе
		Заказ = Неопределено;
	КонецЕсли;
    Возврат Заказ;
КонецФункции

Процедура ОбновитьСтатусQRКода(qrcId, status)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СБП_QRКоды.qrcId КАК qrcId,
		|	СБП_QRКоды.status КАК status,
		|	СБП_QRКоды.ДатаГенерации КАК ДатаГенерации,
		|	СБП_QRКоды.imageParams_mediaType КАК imageParams_mediaType,
		|	СБП_QRКоды.imageParams_content КАК imageParams_content,
		|	СБП_QRКоды.amount КАК amount,
		|	СБП_QRКоды.payload КАК payload,
		|	СБП_QRКоды.qrcType КАК qrcType,
		|	СБП_QRКоды.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды
		|ГДЕ
		|	СБП_QRКоды.qrcId = &qrcId";
	
	Запрос.УстановитьПараметр("qrcId", qrcId);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НаборЗаписейQR = РегистрыСведений.СБП_QRКоды.СоздатьНаборЗаписей();
		НаборЗаписейQR.Отбор.qrcId.Установить(ВыборкаДетальныеЗаписи.qrcId);
		НаборЗаписейQR.Прочитать();
		ЗаписьQR = НаборЗаписейQR[0];
		ЗаписьQR.status = status;
		НаборЗаписейQR.Записать();
	КонецЕсли;
	
КонецПроцедуры	
	
Функция ПлатёжОбработан(ДанныеПлатежа)
	
	Если ТипЗнч(ДанныеПлатежа) <> Тип("Структура") Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
		
	qrcId  = ДанныеПлатежа.qrcId;
	
	Если НЕ ЗначениеЗаполнено(qrcId) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли; 
	
	Контрагент = ПолучитьКонтрагентаПоQRCID(qrcId);
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		НайденКонтрагент = ЛОЖЬ;
	Иначе
		НайденКонтрагент = ИСТИНА;
	КонецЕсли;
	
	Заказ = ПолучитьЗаказПоQRCID(qrcId);
	
	Если НЕ ЗначениеЗаполнено(Заказ) Тогда
		НайденЗаказ = ЛОЖЬ;
	Иначе
		НайденЗаказ = ИСТИНА;
	КонецЕсли;
	
	Если Не НайденКонтрагент И Не НайденЗаказ Тогда
		Текст = "Пришел callback по QR коду" + qrcId + ", но не был найден ни заказ, ни контрагент по нему
		|Телефон плательщика " + ДанныеПлатежа.senderId + "
		|Назначение платежа " + ДанныеПлатежа.comment + "
		|Дата операции " + ДанныеПлатежа.operDate + "
		|Статус " + ДанныеПлатежа.status;
		ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка);	
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Если СтрНайти(ВРЕГ(ДанныеПлатежа.status), "ACCEPTED") = 0 Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Если Не НайденКонтрагент И НайденЗаказ Тогда
		Контрагент = Заказ.Контрагент;
	КонецЕсли;	
	
	СчетДляСБП = Константы.НВД_ОсновнойБанковскийСчетДляСБП.Получить();
	
	Если НЕ ЗначениеЗаполнено(СчетДляСБП) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	СуммаПлатежа = ДанныеПлатежа.amount; //в копейках
	
	Если НЕ ЗначениеЗаполнено(СуммаПлатежа) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли; 
	
	СуммаПлатежа = Число(СуммаПлатежа)/100;  //в рублях
	
	merchantId = ДанныеПлатежа.merchantId;
	
	Валюта = СчетДляСБП.Валюта;
	
	ДатаПлатежа = Дата(СтрЗаменить(ДанныеПлатежа.operDate,"-",""));
	
	БикБанкаОтправителя = ДанныеПлатежа.senderBic;
	
	//БанковскийСчетОтправителя = ДанныеПлатежа.
	Организация = СчетДляСБП.Владелец;
	
	ПоступлениеНаРС = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
	ПоступлениеНаРС.Дата = ДатаПлатежа;
	Если НайденЗаказ Тогда
		ПоступлениеНаРС.ДобавитьОснование(Заказ);
	КонецЕсли;
	ПоступлениеНаРС.Организация = Организация;//СчетДляСБП.Владелец;
	ПоступлениеНаРС.Валюта = Валюта;
	ПоступлениеНаРС.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя;	
	ПоступлениеНаРС.Контрагент = Контрагент;
	ПоступлениеНаРС.Договор = Контрагент.ОсновнойДоговор;
	ПоступлениеНаРС.КомиссияБанка = 0;
	ПоступлениеНаРС.НазначениеПлатежа = ДанныеПлатежа.comment;
	ПоступлениеНаРС.Комментарий = "Загружен из Банка " + "transactionId:" + ДанныеПлатежа.transactionId + " fpTransactionId:" + ДанныеПлатежа.fpTransactionId; 
	ПоступлениеНаРС.Подразделение = Справочники.Подразделения.НайтиПоНаименованию("Основной");
	ПоступлениеНаРС.СтатьяДоходов = Справочники.СтатьиДоходовИРасходов.Продажи; 
	ПоступлениеНаРС.СтатьяДоходовПоНачислению = Справочники.СтатьиДоходовИРасходов.Продажи;
	ПоступлениеНаРС.Сумма = СуммаПлатежа;
	ПоступлениеНаРС.Счет = СчетДляСБП; 
	ПоступлениеНаРС.Автор = Пользователи.ТекущийПользователь();
	ПоступлениеНаРС.ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;
	ПоступлениеНаРС.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(ПоступлениеНаРС, УчитыватьНДС);
	
	Попытка
    	ПоступлениеНаРС.Записать(РежимЗаписиДокумента.Проведение);
		
		ОбработкаСБПКасса = Обработки.СБПКасса.Создать();
		ОбработкаСБПКасса.СоздатьЧекСПроверкойНаСуществующий(ПоступлениеНаРС.Ссылка, "Приход");
		
		ОбновитьСтатусQRКода(qrcId, ДанныеПлатежа.status);
			
		ЗаписатьДокументПоступлениеНаРСПоQRКодуВРегистр(qrcId, ПоступлениеНаРС.Ссылка);
		
		Возврат ИСТИНА;
		
	Исключение
   		Инфо1 = ОписаниеОшибки();
		Инфо2 = ИнформацияОбОшибке();
		
		Инфо = Инфо1 + "
		|" + Инфо2.Описание + "
		|" + ?(Инфо2.Причина = Неопределено, "", Инфо2.Причина.Описание);
		
		ЗаписьЖурналаРегистрации("Запись документа оплаты по Call Back GPB", УровеньЖурналаРегистрации.Ошибка,,,Инфо);
		Возврат ЛОЖЬ;
	КонецПопытки;
	
КонецФункции	

Процедура ЗаписатьДокументПоступлениеНаРСПоQRКодуВРегистр(qrcId, ПоступлениеНаРС)
	НаборЗаписей = РегистрыСведений.СБП_QRКоды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.qrcId.Установить(qrcId);
	НаборЗаписей.Прочитать();
	
	ЗаписьРегистра = НаборЗаписей[0];
	ЗаписьРегистра.ПоступлениеНаРС = ПоступлениеНаРС;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Инфо1 = ОписаниеОшибки();
		Инфо2 = ИнформацияОбОшибке();
		
		Инфо = Инфо1 + "
		|" + Инфо2.Описание + "
		|" + ?(Инфо2.Причина = Неопределено, "", Инфо2.Причина.Описание);
		
		ЗаписьЖурналаРегистрации("Изменение записи в регистре СБП_QRКоды  по /merchant/qrc-status", УровеньЖурналаРегистрации.Ошибка,,,Инфо);
	КонецПопытки;
КонецПроцедуры

Функция MerchantNotificationsPOST(Запрос)
	
	Если Ложь Тогда 
		Запрос = Новый HTTPЗапрос;
	КонецЕсли;
		
	ИменаСвойствСоЗначениямиДата = Новый Массив;
	
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.ОткрытьПоток(Запрос.ПолучитьТелоКакПоток());
		
		ДанныеИнфо = ПрочитатьJSON(ЧтениеJSON, Ложь, ИменаСвойствСоЗначениямиДата);
		
		ЗаписьЖурналаРегистрации("MerchantNotifications", УровеньЖурналаРегистрации.Информация,,,Запрос.ПолучитьТелоКакСтроку());
		
		ЧтениеJSON.Закрыть();
		
		Если НЕ ПлатёжОбработан(ДанныеИнфо) Тогда
			Возврат Новый HTTPСервисОтвет(400);
		КонецЕсли;	
	Исключение	
		Инфо1 = ОписаниеОшибки();
		Инфо2 = ИнформацияОбОшибке();
		
		Инфо = Инфо1 + "
		|" + Инфо2.Описание + "
		|" + ?(Инфо2.Причина = Неопределено, "", Инфо2.Причина.Описание);
		
		ЗаписьЖурналаРегистрации("CallBack GPB", УровеньЖурналаРегистрации.Ошибка,,,Инфо);
		
		Возврат Новый HTTPСервисОтвет(400);	
	КонецПопытки;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;

КонецФункции
